#Задание 1.
# Поработайте с переменными, создайте несколько,
# выведите на экран, запросите у пользователя несколько чисел и
# строк и сохраните в переменные, выведите на экран.

a = 5.89
b = "hello"
c = 102
print(f"{a},{b},{c}")
print("Введите ваше имя: ")
name = input()
print("Введите, сколько у вас рыбок: ")
count_fish = input()
print("Как зовут рыбку-главаря? ")
name_fish = input()