# Задание 1.
# Поработайте с переменными, создайте несколько,
# выведите на экран, запросите у пользователя несколько чисел и
# строк и сохраните в переменные, выведите на экран.

print("Введите ваше имя: ")
name = input()
print("Введите, сколько у вас рыбок: ")
count_fish = input()
print("Как зовут рыбку-главаря? ")
name_fish = input()
print(f"Информация о пользователе: Имя - {name},"
      f"количество рыбок - {count_fish}, имя рыбки-главаря - {name_fish}")
