# Задание 1.
# Поработайте с переменными, создайте несколько,
# выведите на экран, запросите у пользователя несколько чисел и
# строк и сохраните в переменные, выведите на экран.

name = input("Введите ваше имя: ")
count_fish = input("Введите, сколько у вас рыбок: ")
name_fish = input("Как зовут рыбку-главаря? ")
print(f"Информация о пользователе: Имя - {name},"
      f"количество рыбок - {count_fish}, имя рыбки-главаря - {name_fish}")
